Delans-TLE/src/InformationRegisters/ES_CоответствиеПравилОбменаОборудованияOfflineИКурьеров/ES_CоответствиеПравилОбменаОборудованияOfflineИКурьеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ES_CоответствиеПравилОбменаОборудованияOfflineИКурьеров</name>
  <comment>Хранит комбинацию ПравилоОбмена - Сотрудник(курьер)</comment>
  <resources>
    <name>Курьер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ID</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>АдресСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>SSL</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТипАдреса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.ПодключаемоеОборудование</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Delans-TLE/src/CommonModules/ES_РаботаСДоставляемымиУведомлениями/Module.bsl
Процедура ОтправитьУведомление( Уведомление,Курьер) Экспорт
	//EFSOL Шаповал О.А. 03.08.2018 16:07:14 {
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ES_CоответствиеПравилОбменаОборудованияOfflineИКурьеров.Оборудование КАК Оборудование,
	               |	ES_CоответствиеПравилОбменаОборудованияOfflineИКурьеров.Курьер КАК Курьер,
	               |	ES_CоответствиеПравилОбменаОборудованияOfflineИКурьеров.ID КАК ID
	               |ИЗ
	               |	РегистрСведений.ES_CоответствиеПравилОбменаОборудованияOfflineИКурьеров КАК ES_CоответствиеПравилОбменаОборудованияOfflineИКурьеров
	               |ГДЕ
	               |	ES_CоответствиеПравилОбменаОборудованияOfflineИКурьеров.Курьер  = &Курьер";
	
	Запрос.УстановитьПараметр("Курьер",Курьер);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПараметрыУстройства = Выборка.ID.Получить();
		Если ПараметрыУстройства = Неопределено Тогда
			Продолжить;
		Иначе
			Уведомление.Получатели.Добавить(Выборка.ID.Получить());
		КонецЕсли;
	КонецЦикла;
		
	Если Уведомление.Получатели.Количество() > 0 Тогда
		ДанныеАутентификации = "";
		Сертификат = Неопределено;
		//КлючGoogle = СокрЛП(Константы.ES_КлючДоступа.Получить());
		КлючGoogle = "AIzaSyDxTaQvvje27lH8JEHiMNrcBFnlpyziVP4";
		// новый ключ Деланса = AIzaSyBqkBG9uorb-4m0azgGwswKiJZndsRcz60
		ДанныеАутентификации = Новый Соответствие; 
		ДанныеАутентификации.Вставить(ТипПодписчикаДоставляемыхУведомлений.GCM, КлючGoogle);
		УдаленныеТокены = Новый Массив;
		ИнформацияОПроблемеОтправкиДоставляемогоУведомления = Новый Массив;
		Попытка
			ОтправкаДоставляемыхУведомлений.Отправить(Уведомление,ДанныеАутентификации,УдаленныеТокены,Ложь);
		Исключение
		КонецПопытки;
		НеИспользоватьИдентификаторы(УдаленныеТокены);
	КонецЕсли;
	//}EFSOL Шаповал О.А.	
КонецПроцедуры

Процедура НеИспользоватьИдентификаторы (УдаленныеТокены)
	//EFSOL Шаповал О.А. 03.08.2018 17:41:11 {
	
	//}EFSOL Шаповал О.А.
КонецПроцедуры
